# Clear Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSet..::..Clear Method
ElectricalSystemSet Class See Also
---
Removes every item from the set, rendering it empty.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual void Clear()
```

Visual Basic
---
```text
Public Overridable Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear()
```

# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace